package com.zin.record.controller;

/**
 * Created by zhujinming on 2018/8/30.
 */
public class ExcelConstants {

    public static String[] whites = {
            "天天手环", /*"亿动圈",*/ "分动"/*, "芸动汇"*/, "VeryFitPro"
    };

    public static String[] titles = {
            "    日期    ", "媒体位", "操作系统", "广告主",
            "曝光(广告主)", "点击(广告主)", "点击率(广告主)", "CPM 收入（广告主）",
            "CPC 收入（广告主）", "收入(广告主)", "分成后收入",
            "广告位", "日活", "请求数", "曝光数", "点击数",
            "点击率", "填充率", "曝光差异", "点击差异"
    };

    public static String[] sspKeywords = {
            "日期", "广告主", "广告位", "媒体位", "操作系统",
            "是否为真假量", "请求数", "曝光数", "点击数", "点击率",
            "填充率"
    };

    public static String[] gdtKeywords = {
            "时间", "媒体", "广告展示数",
            "点击量", "预计收入",
            "千次展示收益", "点击率"
    };

    public static String[] facebookKeywords = {
            "日期", "国家/地区", "国家/地区名称", "资产编号",
            "资产", "应用编号", "应用名称", "平台", "请求",
            "广告填充请求", "填充率", "展示次数", "显示比率",
            "点击量", "点击率", "千次展示平均费用", "收入"
    };

    public static String[] admobCountrieKeywords1 = {
            "日期", "应用", "广告单元", "国家/地区", "平台",
            "Active View 符合条件的展示次数", "可衡量的展示次数",
            "可衡量的展示次数占比 (%) (%)", "可见展示次数",
            "可见展示次数占比 (%) (%)", "AdMob 广告联盟请求的每千次展示收入 (USD)",
            "AdMob 广告联盟请求次数", "点击次数", "估算收入 (USD)", "展示点击率 (%)",
            "每千次展示收入 (USD)", "展示次数", "匹配率 (%)", "匹配请求数",
            "激励视频广告开始次数", "激励视频广告完成次数", "展示率 (%)"
    };

    public static String[] adMobKeywords = {
            "广告单元", "日期", "应用",
            "Active View 符合条件的展示次数",
            "可衡量的展示次数", "可衡量的展示次数占比 (%) (%)",
            "可见展示次数", "可见展示次数占比 (%) (%)",
            "AdMob 广告联盟请求的每千次展示收入 (USD)",
            "AdMob 广告联盟请求次数",
            "点击次数", "估算收入 (USD)", "展示点击率 (%)",
            "每千次展示收入 (USD)", "展示次数", "匹配率 (%)",
            "匹配请求数", "激励视频广告开始次数",
            "激励视频广告完成次数", "展示率 (%)"
    };

    public static String[] adMobCountrieKeywords = {
            "日期", "广告单元", "国家/地区", "Active View 符合条件的展示次数",
            "可衡量的展示次数", "可衡量的展示次数占比 (%) (%)",
            "可见展示次数", "可见展示次数占比 (%) (%)",
            "AdMob 广告联盟请求的每千次展示收入 (USD)",
            "AdMob 广告联盟请求次数", "点击次数", "估算收入 (USD)",
            "展示点击率 (%)", "每千次展示收入 (USD)", "展示次数",
            "匹配率 (%)", "匹配请求数", "激励视频广告开始次数",
            "激励视频广告完成次数", "展示率 (%)"
    };

    public static String[] whiteCountries = {
            "日本", "法国", "奥地利", "荷兰", "捷克", "印度",
            "爱尔兰", "南非", "澳大利亚", "比利时", "俄罗斯",
            "乌克兰", "巴西", "波兰", "意大利", "加拿大"
    };
}
